war = (0)
print("Добро пожаловать на супер викторину!!!")
print("Когда вышла самая первая версия майнкрафта?")
print("A: 2012 апреля 2")
print("Б: 2010 декабря 14")
print("В: 2011 ноября 18")
print("Г: незнаю")
a = input("вводите ответ: ")
if(a == "В"):
    print("правильно!")
    war=(war+(1))
else:
    print("неправильно!")
    print("Ответ В")


print("Имя первого зарегестрировоного аккаунта в Roblox?")
print("A: David")
print("Б: Qa")
print("В: 1")
print("Г: Admin")
b = input("вводите ответ: ")
if(b == "Г"):
    print("правильно!")
    war=(war+(1))
else:
    print("неправильно!")
    print("Ответ Г")

print("Сколько галактик в No man's sky?")
print("A: Бесконечно")
print("Б: 255")
print("В: 1000")
print("Г: 457")
c = input("вводите ответ: ")
if(c == "Б"):
    print("правильно!")
    war=(war+(1))
else:
    print("неправильно!")
    print("Ответ Б")

print("Каков шанс встретить розовую овцу в Maincraft?")
print("A: 0.16%")
print("Б: 3%")
print("В: 1%")
print("Г: 2;")
d = input("вводите ответ: ")
if(d == "А"):
    print("правильно!")
    war=(war+(1))
else:
    print("неправильно!")
    print("Ответ А")

print("самый редкий моб в майнкрафте?")
print("A: золотая панда")
print("Б: маленький скелет левша наездник на пауке полностю с незеритовой броней")
print("В: варден который появился на земле с маской")
print("Г: маленький зомби житель, с алмазной зачарованной бронёй, верхом на красной панде ")
z = input("вводите ответ: ")
if(z == "Г"):
    print("правильно!")
    war=(war+(1))
else:
    print("неправильно!")
    print("Ответ Г")
print("в каком обновлении будет верблюд?")
print("A: 1.20")
print("Б: 1.19.3")
print("В: 1.18.2")
print("Г: 1.17.3 ")
p = input("вводите ответ: ")
if(p == "Б"):
    print("правильно!")
    war=(war+(1))
else:
    print("неправильно!")
    print("Ответ Г")









print(f"Ваш рекорд: {war}")